rails/ledger_pgsql/app/controllers/ledgers_controller.rb

INSERT INTO "ledgers" ("name", "number", "created_at", "updated_at", "name2", "counter", "number2") VALUES('This is a String value', 1000099042, '2010-06-10 03:46:27.164737', '2010-06-10 03:46:27.164737', 'This is a String value2', 0, 199042) RETURNING "id"
---
  def create
    params[:ledger] ||=  JSON.parse(params['json'])
    @ledger = Ledger.new(params[:ledger])

    response['Access-Control-Allow-Origin']= 'http://ledger.robotarmyma.de:3000'

    respond_to do |format|
      if @ledger.save