rails/ledger/app/controllers/ledgers_controller.rb

SELECT * FROM "ledgers"
---
  def index
    @ledgers = Ledger.all

INSERT INTO "ledgers" ("name", "number", "created_at", "updated_at", "name2", "counter", "number2") VALUES('This is a String value', 1000099042, '2010-06-10 00:14:48', '2010-06-10 00:14:48', 'This is a String value2', 0, 199042)
---
  def create
    @ledger = Ledger.new(params[:ledger])

    respond_to do |format|
      if @ledger.save